app/Controllers/MahasiswaController.php

            return $this->failValidationErrors($response);
        }

        $this->model->insert([
            'npm'            => esc($this->request->getVar('npm')),
            'nama_mahasiswa' => esc($this->request->getVar('nama_mahasiswa')),
            'program_studi'  => esc($this->request->getVar('program_studi')),
            'judul_skripsi'  => esc($this->request->getVar('judul_skripsi')),
            'email'          => esc($this->request->getVar('email')),
        ]);
---
INSERT INTO `mahasiswa` (`npm`, `nama_mahasiswa`, `program_studi`, `judul_skripsi`, `email`) VALUES ('77777777', 'Apa aja', 'apa aja', 'Apa aja lah', 'apaaja@gmail.com')

            return $this->failValidationErrors($response);
        }

        $this->model->update($npm, [
            'nama_mahasiswa' => esc($this->request->getVar('nama_mahasiswa')),
            'program_studi'  => esc($this->request->getVar('program_studi')),
            'judul_skripsi'  => esc($this->request->getVar('judul_skripsi')),
            'email'          => esc($this->request->getVar('email')),
        ]);
---
UPDATE `mahasiswa` SET `nama_mahasiswa` = 'ABCD', `program_studi` = 'Mancing', `judul_skripsi` = 'Mancing Perkoro', `email` = 'abc@gmail.com'
WHERE `mahasiswa`.`npm` IN ('12345678')