app/Controllers/RuanganController.php

DELETE FROM `ruangan`
WHERE `kode_ruangan` IN ('J.9.9')
---
    public function delete($kode_ruangan = null)
    {
        $this->model->delete($kode_ruangan);